package com.example.svetlogorskchpp.zeroVision

enum class ZeroVisionType(val text: String) {
    ZERO_VISION_1_SUPERVISION_1("• Я подаю пример своим работникам для подражания и демонстрирую приверженность принципам безопасности и гигиены труда;\n\n"),
    ZERO_VISION_1_SUPERVISION_2("• Я следую правилам и использую средства индивидуальной защиты;\n\n"),
    ZERO_VISION_1_SUPERVISION_3("• Я немедленно реагирую на нарушение моим работником требований охраны труда и провожу инструктаж;\n\n"),
    ZERO_VISION_1_SUPERVISION_4("• Я не допускаю беспорядка и халатности на рабочем месте.\n\n\n"),

    ZERO_VISION_1_WORKER_1("• Я несу персональную ответственность за безопасное выполнение поставленных ему задач и безопасное рабочее место;\n\n"),
    ZERO_VISION_1_WORKER_2("• Я соблюдаю инструкции (инструкции по охране труда, пожарной безопасности, технологические инструкции) и применяю безопасные методы труда;\n\n"),
    ZERO_VISION_1_WORKER_3("• Я использую средства индивидуальной защиты и следую знакам безопасности;\n\n"),
    ZERO_VISION_1_WORKER_4("• Я обращаюсь за помощью к своему руководителю при возникновении вопросов по безопасному проведению работ;\n\n"),
    ZERO_VISION_1_WORKER_5("• Я применяю «ПРАВО НА ПРИОСТАНОВКУ РАБОТ» в случае выявления небезопасного проведения работ для предотвращения возможных происшествий;\n\n"),
    ZERO_VISION_1_WORKER_6("• Я внимателен по отношению к безопасному выполнению работ другими работниками\n\n"),

    ZERO_VISION_2_DANGER_1("• Опасность травмирования движущимися частями механизмов и оборудования;\n\n"),
    ZERO_VISION_2_DANGER_2("• Опасность пореза частей тела острыми кромками металлической стружки;\n\n"),
    ZERO_VISION_2_DANGER_3("• Опасность падения при передвижении или с высоты;\n\n"),
    ZERO_VISION_2_DANGER_4("• Опасность поражения электрическим током\n\n"),
    ZERO_VISION_2_DANGER_5("• Опасность травмирования в результате выброса подвижной обрабатываемой детали, предмета, осколка;\n\n"),
    ZERO_VISION_2_DANGER_6("• Опасность ожога от воздействия открытого пламени и поверхностей\n\n"),
    ZERO_VISION_2_DANGER_COLOR("• Опасность"),

}