package com.example.svetlogorskchpp.__domain.en.electrical_equipment

enum class ElCategory(val str: String) {
    //Остальное
    //Оч. сооружения
    //Обессоливание
    //БНТ
    //Багерная
    //К/О
    //КТЦ к/о
    //КТЦ т/о
    //НДВ
    //ПН
    //ПЭН
    //Предочистка
    //СН
    //ТУ
    //ЦН
    //ЦЦР
    //Аммиачное х-во
    //Гидрозийное х-во
    //Кислотное х-во
    //Коагулянтное х-во
    //Насосная 1 оч. т/с
    //Солевое х-во
    //Сх. известкового х-во
    //Сх. фосфатного х-во
    //Узел НВК промывки
    //Щелочное х-во
    //ТГ-1
    //ТГ-3
    //ТГ-4
    //ТГ-5
    //ТГ-6
    //К/А-1
    //К/А-6
    //К/А-7
    //К/А-8
    //К/А-9
}